SOAP_Tutorial_Apache_CXF/SOAPClientXMLConfig/result.xml

<soap:Envelope
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<wsse:UsernameToken
				wsu:Id="UsernameToken-947ff662-365b-4706-8450-8b80a82dec55">
				<wsse:Username>gaja</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<ns2:add xmlns:ns2="http://service.app.gaja.com/">
			<arg0>
				<num1>5</num1>
				<num2>2</num2>
			</arg0>
		</ns2:add>
	</soap:Body>
</soap:Envelope>
